RT-Thread/rt-thread/bsp/nrf5x/libraries/drivers/nrfx_spim.c
    p_cb->evt.xfer_desc = *p_xfer_desc;

    if (p_cb->ss_pin != NRFX_SPIM_PIN_NOT_USED)
    {
#if NRFX_CHECK(NRFX_SPIM_EXTENDED_ENABLED)
        if (!p_cb->use_hw_ss)
#endif
        {
            if (p_cb->ss_active_high)
            {
                nrf_gpio_pin_set(p_cb->ss_pin);
            }
            else
            {
                nrf_gpio_pin_clear(p_cb->ss_pin);
            }
        }
    }

    return spim_xfer(p_instance->p_reg, p_cb,  p_xfer_desc, flags);
}

/**************************************************************
*
* 改写的spim_xfer
*
***************************************************************/
static nrfx_err_t rtt_spim_xfer(NRF_SPIM_Type           * p_spim,
                            spim_control_block_t        * p_cb,
                            nrfx_spim_xfer_desc_t const * p_xfer_desc,
                            uint32_t                      flags,
							struct rt_spi_message       * message,
                            struct rt_spi_device        * dev)
{
	#define DMA_TRANS_MIN_LEN  (20) /* only buffer length >= DMA_TRANS_MIN_LEN will use DMA mode */
	
    nrfx_err_t err_code;
    // EasyDMA requires that transfer buffers are placed in Data RAM region;
    // signal error if they are not.
    if ((p_xfer_desc->p_tx_buffer != NULL && !nrfx_is_in_ram(p_xfer_desc->p_tx_buffer)) ||
        (p_xfer_desc->p_rx_buffer != NULL && !nrfx_is_in_ram(p_xfer_desc->p_rx_buffer)))
    {
        p_cb->transfer_in_progress = false;
        err_code = NRFX_ERROR_INVALID_ADDR;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

	#if USING_SPI_DMA
	/* 赋值给spim_control_block_t的void *context */
		struct spi_dma_message *mess = (struct spi_dma_message *)(p_cb->p_context);
		mess->cs_take = message->cs_take;
		mess->cs_release = message->cs_release;
		mess->flags = flags;
		mess->spim = p_spim;
	#endif
	
	nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_END);
	
	#if NRFX_CHECK(NRFX_SPIM_NRF52_ANOMALY_109_WORKAROUND_ENABLED)
		p_cb->tx_length = 0;
		p_cb->rx_length = 0;
	#endif
	
	nrf_spim_tx_buffer_set(p_spim, p_xfer_desc->p_tx_buffer, p_xfer_desc->tx_length);
	nrf_spim_rx_buffer_set(p_spim, p_xfer_desc->p_rx_buffer, p_xfer_desc->rx_length);

	#if NRFX_CHECK(NRFX_SPIM3_NRF52840_ANOMALY_198_WORKAROUND_ENABLED)
		if (p_spim == NRF_SPIM3)
		{
			anomaly_198_enable(p_xfer_desc->p_tx_buffer, p_xfer_desc->tx_length);
		}
	#endif
	
    spim_list_enable_handle(p_spim, flags);

    if (!(flags & NRFX_SPIM_FLAG_HOLD_XFER))
    {
        nrf_spim_task_trigger(p_spim, NRF_SPIM_TASK_START);
//		rt_kprintf("SPIM task started.\n");
    }
#if NRFX_CHECK(NRFX_SPIM_NRF52_ANOMALY_109_WORKAROUND_ENABLED)
    if (flags & NRFX_SPIM_FLAG_HOLD_XFER)
    {
        nrf_spim_event_clear(p_spim, NRF_SPIM_EVENT_STARTED);
        p_cb->tx_length = p_xfer_desc->tx_length;
        p_cb->rx_length = p_xfer_desc->rx_length;
        nrf_spim_tx_buffer_set(p_spim, p_xfer_desc->p_tx_buffer, 0);
        nrf_spim_rx_buffer_set(p_spim, p_xfer_desc->p_rx_buffer, 0);
        nrf_spim_int_enable(p_spim, NRF_SPIM_INT_STARTED_MASK);
    }
#endif

    if (p_cb->handler == RT_NULL || (p_xfer_desc->rx_length<= DMA_TRANS_MIN_LEN && p_xfer_desc->tx_length<= DMA_TRANS_MIN_LEN))
    {
		//没有回调函数进入死循环
		//或者接受/发送字节小于最小的数量
//		spim_int_enable(p_spim, ((mess->flags) & NRFX_SPIM_FLAG_NO_XFER_EVT_HANDLER));
        if (!(flags & NRFX_SPIM_FLAG_HOLD_XFER))
        {
            while (!nrf_spim_event_check(p_spim, NRF_SPIM_EVENT_END))
            {
				
			}
//			rt_kprintf("SPIM transfer end.\n");
 			p_cb->transfer_in_progress = false;
        }

#if NRFX_CHECK(NRFX_SPIM3_NRF52840_ANOMALY_198_WORKAROUND_ENABLED)
        if (p_spim == NRF_SPIM3)
        {
            anomaly_198_disable();
        }
#endif

		if (dev->cs_pin != PIN_NONE && message->cs_release)
		{
		#if NRFX_CHECK(NRFX_SPIM_EXTENDED_ENABLED)
			if (!p_cb->use_hw_ss)
		#endif
			{
				if (p_cb->ss_active_high)
					nrf_gpio_pin_clear(dev->cs_pin);
				else
					nrf_gpio_pin_set(dev->cs_pin);
			}
		}
    }
    else
    {
		#if USING_SPI_DMA
			spim_int_enable(p_spim, !(flags & NRFX_SPIM_FLAG_NO_XFER_EVT_HANDLER));
			p_cb->transfer_in_progress = false;
			if (rt_completion_wait(mess->cpt, 5000) != RT_EOK)
				{
					rt_kprintf("wait for DMA interrupt overtime!");
					return NRFX_ERROR_TIMEOUT;
				}
		#else
			spim_int_enable(p_spim, !(flags & NRFX_SPIM_FLAG_NO_XFER_EVT_HANDLER));
		#endif
    }
    err_code = NRFX_SUCCESS;
    NRFX_LOG_INFO("Function: %s, error code: %s.", __func__, NRFX_LOG_ERROR_STRING_GET(err_code));
    return err_code;
}

/**************************************************************
*
* 改写的nrfx_spim_xfer
*
***************************************************************/

nrfx_err_t rtt_nrfx_spim_xfer(nrfx_spim_t const         *p_instance,
							nrfx_spim_xfer_desc_t const *p_xfer_desc,
							uint32_t                     flags,
							struct rt_spi_message       *message,
                            struct rt_spi_device        *dev)
{
    spim_control_block_t * p_cb = &m_cb[p_instance->drv_inst_idx];
    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);
    NRFX_ASSERT(p_xfer_desc->p_tx_buffer != NULL || p_xfer_desc->tx_length == 0);
    NRFX_ASSERT(p_xfer_desc->p_rx_buffer != NULL || p_xfer_desc->rx_length == 0);
    NRFX_ASSERT(SPIM_LENGTH_VALIDATE(p_instance->drv_inst_idx,
                                     p_xfer_desc->rx_length,
                                     p_xfer_desc->tx_length));
    NRFX_ASSERT(!(flags & NRFX_SPIM_FLAG_HOLD_XFER) ||
                (p_cb->ss_pin == NRFX_SPIM_PIN_NOT_USED));

    nrfx_err_t err_code = NRFX_SUCCESS;

    if (p_cb->transfer_in_progress)
    {
        err_code = NRFX_ERROR_BUSY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    else
    {
        if (p_cb->handler && !(flags & (NRFX_SPIM_FLAG_REPEATED_XFER |
                                        NRFX_SPIM_FLAG_NO_XFER_EVT_HANDLER)))
        {
            p_cb->transfer_in_progress = true;
        }
    }

